paper/sbc.tex
% Intended LaTeX compiler: pdflatex
\documentclass[12pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[english]{babel}
\usepackage{sbc-template}
\usepackage{url}
\sloppy
\date{}
\title{PCAD \ldots{} through SimGrid}
\hypersetup{
 pdfauthor={Rayan Raddatz de Matos, Lucas Mello Schnorr},
 pdftitle={PCAD \ldots{} through SimGrid},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.5.5)},
 pdflang={English}}
\begin{document}


\makeatletter
\let\orgtitle\@title
\makeatother

\title{\orgtitle}

\author{
   Rayan Raddatz de Matos\inst{1},
   Lucas Mello Schnorr\inst{1}
   }

\address{
   Institute of Informatics, Federal University of Rio Grande do Sul (UFRGS)\\
   Caixa Postal 15.064 -- 91.501-970 -- Porto Alegre -- RS -- Brazil
   \email{{rayan.raddatz, schnorr}@inf.ufrgs.br}}

\maketitle

\begin{abstract}
Put the abstract here.
\end{abstract}

\section{Introduction}
\label{sec:org6ddb3b4}

[Current state of HPC]
[Sustainability and Enviroment]

[S4U and SimGrid]

[Why use a simulator and not the cluster?]
[Simulating with SimGrid]

[This article]


\section{Related Work}
\label{sec:org20a5065}
\label{org2533a59}

[TCC Arthur?]

[SimGrid paper]

[Look for some refs]


\section{Methods and Materials}
\label{sec:org20fe341}

[Calibration]

[S4U]

[Reproducibility]


\section{Results}
\label{sec:orgbdcc08b}

[Results, differences: accuracy, time, etc\ldots{}]

\section{Conclusion}
\label{sec:org72ad8ac}

[Is it worth and suitable to use simulators?]


\section*{Acknowledgements}
We would like to thank the PCAD at INF/UFRGS for making infrastructure
and hardware used in the experiments available. We also acknowledge
the Brazilian National Council for Scientific Technological
Development (CNPq) for their financial support through the PIBIC-UFRGS
scholarship.

\bibliographystyle{sbc.bst}
\bibliography{refs}
\end{document}